Autodesk.Revit.DB.Transaction.Commit(Autodesk.Revit.DB.FailureHandlingOptions)
Commits all changes made to the model during the transaction.
options:
A set of options
to be used for handling eventual failures during this call.
The options are only used temporarily during the commitment process. After
the transaction is finished, the options will be reset to their default values.
Returns:
If finished successfully, this method returns TransactionStatus.Committed
Note it is possible the RolledBack status is returned instead as an outcome
of failure handling. If TransactionStatus.Pending is returned it means that
failure handling has not been finalized yet and Revit awaits user's actions.
Until committing is fully finalized, no changes to the document can be made
(including starting of new transactions).Be aware that the returned status does not have to be necessarily the same like
the status returned by Autodesk.Revit.DB.Transaction.GetStatus even when the method is called
immediately after committing the transaction. Such difference may happen due to actions
made by a transaction finalizer, if there was one set.
(See Autodesk.Revit.DB.FailureHandlingOptions for more details.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Document is a linked file. Transactions can only be used in primary documents (projects or families.)
-or-
The current status of the transaction is not 'Started'.
Transaction must be started before calling Commit or Rollback.
-or-
The transaction's document is currently in failure mode.
No transaction operations are permitted until failure handling is finished.

Autodesk.Revit.DB.Transaction.#ctor(Autodesk.Revit.DB.Document,System.String)
Instantiates a transaction object
Remarks:
The transaction does not start by creating a transaction object.
One of the 'Start' methods will need to be called  in order to start
this transaction.
document:
The document for which this transaction is going to be used.
name:
The name of the transaction. This name will appear in the undo menu
once the transaction is successfully committed. The name must not be empty.
The name can be reset later by either calling Autodesk.Revit.DB.Transaction.SetName(System.String) or
by using the name argument in the Autodesk.Revit.DB.Transaction.Start(System.String) method.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name argument is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Transaction.#ctor(Autodesk.Revit.DB.Document)
Instantiates a transaction object.
Remarks:
The transaction does not start by creating a transaction object.
One of the 'Start' methods will need to be called  in order to start
this transaction.
A transaction cannot start unless is has a valid (non-empty) name.
Because this constructor does not take a name, a name must be assigned later
before or during the 'Start' method.
document:
The document for which this transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null